# 01. Importing Libraries

In [1]:
#import libraries

import pandas as pd

import numpy as np

import os

# 02. Importing Data

In [2]:
#importing data with shortcut
#defining path
path = r'C:\Users\USER\Documents\CF\Phyton\Instacart Basket Analysis'
#importing data (orders)
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)
#importing data (products)
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

# 03 Finding Missing Values

In [3]:
#finding missing values in products table
    #isnull() if there are an empty cell that give TRUE
    #sum ()megszámolja hány darab üres van, mert a TRUE 1-nek számít, a FALSE meg 0-nak
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [4]:
#finding missing values in orders table
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [12]:
# I want to see the rows with missing values in df_prods
df_nan_prod = df_prods[df_prods['product_name'].isnull() == True]

In [13]:
df_nan_prod

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [14]:
# I want to see the rows with missing values in df_ords
df_nan_ords = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [15]:
df_nan_ords

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

LOTS of missing values in orders!!! I have to do sg with this (wrong datatype str-int?)

In [38]:
df_ords.shape

(3421083, 7)

In [40]:
#missing values on df_ords in % 
a = 206209
b = 34210.83
missingvalue = a / b
print ("Missing values: " + str(missingvalue) + " % ")

Missing values: 6.027594185817765 %

##  Addressing Missing Values

In [16]:
# we have 16 rows with missing values. How many percent is this 16 to the whole dataframe?
    #number of all rows
df_prods.shape

(49693, 5)

In [22]:
a = 16
b = 496.93
missingvalue = a / b
print ("Missing values: " + str(missingvalue) + " % ")

Missing values: 0.0321976938401787 %

In [ ]:
# rows with missing values are just a tiny part of the dataframe, we can delete them

## Solving the Problem of Missing Values

### Delete Rows in Products Dataframe

In [23]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [24]:
#check
df_prods_clean.shape

(49677, 5)

# 04 Duplicates

In [25]:
#looking for duplicates in prods
df_dups_prods = df_prods_clean[df_prods_clean.duplicated()]

In [26]:
df_dups_prods

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [27]:
#drop the duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [28]:
#check
df_prods_clean_no_dups.shape

(49672, 5)

# Exercise Directions

#### 02 Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.
Tip: Keep an eye on min and max values!

In [30]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Order number maximum seems to be too low
Not defined the first day of the week and this is 0 not 1 :(
206209 values missing (?) from "days_since_prior_order"

#### 03 Check for mixed-type data in your df_ords dataframe.

In [ ]:
#that was in the CF course, but it doesn't work....
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [33]:

# Check for mixed-type data with Google
mixed_types_columns = []

for col in df_ords.columns:
    if df_ords[col].apply(type).eq(str).any():
        mixed_types_columns.append(col)

if mixed_types_columns:
    print(f"Columns with mixed-type data: {mixed_types_columns}")
else:
    print("No columns with mixed-type data.")

Columns with mixed-type data: ['eval_set']

In [35]:
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis=1)
    if weird.any():
        print(col)

In [36]:
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

#### 04 If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

In [37]:
#convert to string
df_ords['eval_set'] = df_ords['eval_set'].astype('str')

#### 05 Run a check for missing values in your df_ords dataframe.
In a markdown cell, report your findings and propose an explanation for any missing values you find.
#### 06 Address the missing values using an appropriate method.
In a markdown cell, explain why you used your method of choice.

I've already done it. 

6% of the data from 'days_since_prior_order' column are missing. Maybe this was the first order from theese coustumers, so "prior order" makes no sense in this case. I try to check this to compare the columns 'days_since_prior_order' and 'order_number'

In [41]:
#compare the columns 'days_since_prior_order' and 'order_number'
df_nan_ords_order_number_not1 = df_nan_ords[df_nan_ords['order_number'] != 1]

In [43]:
df_nan_ords_order_number_not1.shape

(0, 7)

#### No need to impute
That means all of the rows with missing data in "days_since_prior_order" belongs to first orders
No worries if 'days_since_prior_order' are missing for the first order. It's because there were no orders before, so there's no information in the "days_since_prior_order" column. It's not like having zero days, which would mean a previous order on the same day. In this case, there's just no info for "days_since_prior_order" because there's no previous order. That's fine, and there's no need to add anything for these missing values.

#### 07 Run a check for duplicate values in your df_ords data.
In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

There are no duplicates

In [47]:
# this will filter the duplicates
df_dups_ords = df_ords[df_ords.duplicated()]

In [49]:
df_dups_ords.shape

(0, 7)

#### 08 Address the duplicates using an appropriate method.
In a markdown cell, explain why you used your method of choice.

No duplicates, no need to intervention.

# Export to csv

In [29]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

In [50]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))